ChessCamp_Phase_5_Starter/app/controllers/camps_controller.rb

SELECT "camps".* FROM "camps" WHERE (start_date >= '2014-05-02') AND "camps"."active" = 't' ORDER BY start_date, end_date LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "camps" WHERE (start_date >= '2014-05-02') AND "camps"."active" = 't'
---
  def index
    @upcoming_camps = Camp.upcoming.active.chronological.paginate(:page => params[:page]).per_page(10)

SELECT "instructors".* FROM "instructors" INNER JOIN "camp_instructors" ON "instructors"."id" = "camp_instructors"."instructor_id" WHERE "camp_instructors"."camp_id" = ? ORDER BY last_name, first_name  [["camp_id", 16]]
SELECT "registrations".* FROM "registrations" INNER JOIN "students" ON "students"."id" = "registrations"."student_id" WHERE "registrations"."camp_id" = ? ORDER BY students.last_name, students.first_name LIMIT 10 OFFSET 0  [["camp_id", 1]]
SELECT COUNT(*) FROM "registrations" INNER JOIN "students" ON "students"."id" = "registrations"."student_id" WHERE "registrations"."camp_id" = ?  [["camp_id", 1]]
---
  def show
    @instructors = @camp.instructors.alphabetical.to_a
    @camp_registrations = @camp.registrations.by_student.paginate(:page => params[:page]).per_page(10)

SELECT "camps".* FROM "camps" WHERE "camps"."id" = ? LIMIT 1  [["id", "16"]]
---
    def set_camp
      @camp = Camp.find(params[:id])