ChessCamp_Phase_5_Starter/app/controllers/curriculums_controller.rb

SELECT "curriculums".* FROM "curriculums" WHERE "curriculums"."active" = 't' ORDER BY name LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "curriculums" WHERE "curriculums"."active" = 'f'
---
  def index
    @active_curriculums = Curriculum.active.alphabetical.paginate(:page => params[:page]).per_page(10)

SELECT "camps".* FROM "camps" WHERE "camps"."curriculum_id" = ? ORDER BY start_date, end_date  [["curriculum_id", 5]]
---
  def show
    @camps = @curriculum.camps.chronological.to_a

SELECT "curriculums".* FROM "curriculums" WHERE "curriculums"."id" = ? LIMIT 1  [["id", "5"]]
---
    def set_curriculum
      @curriculum = Curriculum.find(params[:id])