ChessCamp_Phase_5_Starter/app/controllers/families_controller.rb

  def index
    @active_families = Family.active.alphabetical.paginate(:page => params[:page]).per_page(10)
---
SELECT "families".* FROM "families" WHERE "families"."active" = 't' ORDER BY family_name LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "families" WHERE "families"."active" = 't'

  def show
    @students=@family.students.alphabetical.to_a
---
SELECT "students".* FROM "students" WHERE "students"."family_id" = ? ORDER BY last_name, first_name  [["family_id", 10]]

    def set_family
      @family = Family.find(params[:id])
---
SELECT "families".* FROM "families" WHERE "families"."id" = ? LIMIT 1  [["id", "10"]]