ChessCamp_Phase_5_Starter/app/controllers/home_controller.rb

  def index
		@upcoming_camps = Camp.upcoming.active.chronological.paginate(:page => params[:page]).per_page(5)
		if logged_in?&&current_user.role?(:instructor)
			@instructor = Instructor.find(current_user.instructor_id)
			@user_upcoming_camps = @instructor.camps.upcoming.chronological
      @past_camps = @instructor.camps.past.chronological
		end

    if logged_in?&&current_user.role?(:admin)
      @instructor = Instructor.find(current_user.instructor_id)
      @instructor_camps = Instructor.active.alphabetical.paginate(:page => params[:page]).per_page(10)
      @camps = Camp.upcoming.active.chronological.paginate(:page => params[:page]).per_page(10)
---
SELECT "camps".* FROM "camps" WHERE (start_date >= '2014-05-07') AND "camps"."active" = 't' ORDER BY start_date, end_date LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "camps" WHERE (start_date >= '2014-05-07') AND "camps"."active" = 't'
SELECT "instructors".* FROM "instructors" WHERE "instructors"."id" = ? ORDER BY "instructors"."id" ASC LIMIT 1  [["id", 5]]
SELECT "camps".* FROM "camps" INNER JOIN "camp_instructors" ON "camps"."id" = "camp_instructors"."camp_id" WHERE "camp_instructors"."instructor_id" = ? AND (start_date >= '2014-05-07') ORDER BY start_date, end_date  [["instructor_id", 5]]
SELECT "instructors".* FROM "instructors" WHERE "instructors"."active" = 't' ORDER BY last_name, first_name LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "instructors" WHERE "instructors"."active" = 't'
SELECT "camps".* FROM "camps" INNER JOIN "camp_instructors" ON "camps"."id" = "camp_instructors"."camp_id" WHERE "camp_instructors"."instructor_id" = ? LIMIT 10 OFFSET 0  [["instructor_id", 1]]
SELECT COUNT(*) FROM "camps" INNER JOIN "camp_instructors" ON "camps"."id" = "camp_instructors"."camp_id" WHERE "camp_instructors"."instructor_id" = ? AND (start_date >= '2014-05-07')  [["instructor_id", 5]]