ChessCamp_Phase_5_Starter/app/controllers/instructors_controller.rb

SELECT "instructors".* FROM "instructors" WHERE "instructors"."active" = 't' ORDER BY last_name, first_name LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "instructors" WHERE "instructors"."active" = 't'
---
  def index
    @active_instructors = Instructor.active.alphabetical.paginate(:page => params[:page]).per_page(10)

UPDATE "instructors" SET "picture" = ? WHERE "instructors"."id" = 10  [["picture", "620341_10151011813333994_886728491_o.jpg"]]
---
  def update
    authorize! :update, @instructor
    if @instructor.update(instructor_params)

SELECT "instructors".* FROM "instructors" WHERE "instructors"."id" = ? LIMIT 1  [["id", "11"]]
---
    def set_instructor
      @instructor = Instructor.find(params[:id])