ChessCamp_Phase_5_Starter/app/controllers/locations_controller.rb

  def index
    authorize! :index, @location
    @active_locations = Location.active.alphabetical.paginate(:page => params[:page]).per_page(10)
---
SELECT "locations".* FROM "locations" WHERE "locations"."active" = 't' ORDER BY name LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "locations" WHERE "locations"."active" = 'f'

  def show
    @camps = @location.camps.alphabetical.to_a
---
SELECT "camps".* FROM "camps" INNER JOIN "curriculums" ON "curriculums"."id" = "camps"."curriculum_id" WHERE "camps"."location_id" = ? ORDER BY name  [["location_id", 4]]

    def set_location
      @location = Location.find(params[:id])
---
SELECT "locations".* FROM "locations" WHERE "locations"."id" = ? LIMIT 1  [["id", "4"]]