ChessCamp_Phase_5_Starter/app/controllers/registrations_controller.rb

INSERT INTO "registrations" ("camp_id", "payment_status", "points_earned", "student_id") VALUES (?, ?, ?, ?)  [["camp_id", 2], ["payment_status", "full"], ["points_earned", 800], ["student_id", 195]]
---
  def create
    @registration = Registration.new(registration_params)
    if @registration.save