ChessCamp_Phase_5_Starter/app/controllers/students_controller.rb

  def index
    @active_students = Student.active.alphabetical.paginate(:page => params[:page]).per_page(10)
---
SELECT "students".* FROM "students" WHERE "students"."active" = 't' ORDER BY last_name, first_name LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "students" WHERE "students"."active" = 't'

  def show
    authorize! :read, @student
    @student_registrations = @student.registrations.paginate(:page => params[:page]).per_page(10)
---
SELECT "registrations".* FROM "registrations" WHERE "registrations"."student_id" = ? LIMIT 10 OFFSET 0  [["student_id", 57]]
SELECT COUNT(*) FROM "registrations" WHERE "registrations"."student_id" = ?  [["student_id", 57]]

  def create
    @student = Student.new(student_params)
    if @student.save
---
INSERT INTO "students" ("date_of_birth", "family_id", "first_name", "last_name") VALUES (?, ?, ?, ?)  [["date_of_birth", Wed, 06 May 2009], ["family_id", 99], ["first_name", "Ka"], ["last_name", "Par"]]

  def update
    authorize! :update, @student
    if @student.update(student_params)
---
UPDATE "students" SET "family_id" = ? WHERE "students"."id" = 229  [["family_id", 0]]