ChessCamp_Phase_5_Starter/app/views/camps/_camp_details.html.erb


<%= "Registrations (#{@camp.registrations.count})" %><br /><br />
---
SELECT "registrations".* FROM "registrations" WHERE "registrations"."camp_id" = ?  [["camp_id", 6]]
SELECT COUNT(*) FROM "registrations" WHERE "registrations"."camp_id" = ?  [["camp_id", 1]]