ChessCamp_Phase_5_Starter/app/views/camps/_camp_students.html.erb

    <tbody>
      <% @camp_registrations.map { |reg| reg.student }.each do |student| %>
---
SELECT "students".* FROM "students" WHERE "students"."id" = ? ORDER BY "students"."id" ASC LIMIT 1  [["id", 1]]