ChessCamp_Phase_5_Starter/app/views/camps/_payment_report.html.erb

SELECT "registrations".* FROM "registrations" WHERE "registrations"."camp_id" = ?  [["camp_id", 6]]
---
      <% sum = 0%>
      <% @camp.registrations.each do |reg| %>