ChessCamp_Phase_5_Starter/app/views/students/_form.html.erb

    <%= f.input :date_of_birth, label: "Date of birth", as: :string, :input_html => {:class => "avg datepicker"} %>
    <%= f.input :family_id, :collection => Family.active.alphabetical.all.map{|f| [f.family_name, f.id]} %>
---
SELECT "families".* FROM "families" WHERE "families"."active" = 't' ORDER BY family_name