ChessCamp_Phase_5_Starter/app/views/home/_admin_home.html.erb

	<div class="span12">
		<h1><%= "Welcome #{current_user.instructor.first_name}, the Adminstrator!" %> </h1>
---
SELECT "instructors".* FROM "instructors" WHERE "instructors"."id" = ? ORDER BY "instructors"."id" ASC LIMIT 1  [["id", 1]]