ChessCamp_Phase_5_Starter/app/views/home/_instructor_camps.html.erb

SELECT COUNT(*) FROM "camps" INNER JOIN "camp_instructors" ON "camps"."id" = "camp_instructors"."camp_id" WHERE "camp_instructors"."instructor_id" = ?  [["instructor_id", 7]]
---
    <td><%= link_to instructor.name, instructor_path(instructor) %></td>
    <td align="center"><%= instructor.camps.size %></td>