ChessCamp_Phase_5_Starter/app/views/home/_instructor_home.html.erb

SELECT "instructors".* FROM "instructors" WHERE "instructors"."id" = ? LIMIT 1  [["id", 5]]
---
	<div class="span12">
		<h1><%= "Welcome #{current_user.instructor.first_name} !" %> </h1>