ChessCamp_Phase_5_Starter/app/views/home/_registration_counts.html.erb

SELECT COUNT(*) FROM "registrations" WHERE "registrations"."camp_id" = ?  [["camp_id", 6]]
---
    <td><%= link_to camp.name, camp_path(camp) %></td>
    <td align="center"><%= camp.registrations.count %></td>